app/Controllers/accessoriesController.php

    public function productdetail($pc)
    {
        if ((session()->has('logged_info'))) {
            $data = session()->get('logged_info');
            $userid = $data['user_id'];
        }
        if ((session()->has('logged1_info'))) {
            $data = session()->get('logged1_info');
            $userid = $data['user_id'];
        }
        $db = db_connect();
        $result = $db->query("SELECT * FROM `accessories` WHERE `ProductCode`= '$pc' ");
        // var_dump($result->getResult());exit();
        foreach ($result->getResult() as $key) {

            $ss[] = array(
                'id' => $key->Id,
                'userid' => $userid,
                'Product_code' => $key->ProductCode,
                'Product_name' => $key->Product_name,
                'Product_price' => $key->Product_price,
                'ProductDesc' => $key->ProductDesc,
                'image1' => $key->image1,
                'image2' => $key->image2,
                'image3' => $key->image3,
                'image4' => $key->image4,
                'image5' => $key->image5,
                'image6' => $key->image6,
                'size' => $key->size,
                // 'material' => $key->material,
                'fit' => $key->fit,
                'folder' => 'accessories',
                'table' => 'accessories'
            );
---
SELECT * FROM `accessories` WHERE `ProductCode`= 'AW-5SRL8'