app/Controllers/Admincontroller.php

    $password = $this->request->getVar('password');
    $admin = new AdminModel();

    if($row = $admin->where('username',$username)->first()) {
---
SELECT *
FROM `admins`
WHERE `username` = 'Beseen'
 LIMIT 1

public function editbanner(){
        // echo '1';
    $db  = \Config\Database::connect();
    $id = $this->request->getVar('id');
        // var_dump($id);exit();

    $builder = $db->table('Banner_Master');
    $builder->where('banner_id',$id);
    $result = $builder->get();
---
SELECT *
FROM `Banner_Master`