app/Controllers/Admincontroller.php

    public function editbanner()
    {
        // echo '1';
        $db  = \Config\Database::connect();
        $id = $this->request->getVar('id');
        // var_dump($id);exit();

        $builder = $db->table('Banner_Master');
        $builder->where('banner_id', $id);
        $result = $builder->get();
---
SELECT *
FROM `Banner_Master`
WHERE `banner_id` = '58'

    public function Updatebanner()
    {
        helper(['form', 'url']);
        $model = new BannerModel();
        $db  = \Config\Database::connect();
        //    var_dump($banner_type);exit();
        $banner_id = $_POST['banner_id'];
        // var_dump($banner_id);exit();
        $file_name = $this->request->getFile('banner1');
        // var_dump($file_name);exit();
        if(empty($_POST['button'])){
            $builder = $db->table('Banner_Master');
            $builder->where('banner_id', $banner_id);
            $result = $builder->get();
---
SELECT *
FROM `Banner_Master`
WHERE `banner_id` = '58'

            $cover1 = $this->resizeImage($file_name, $fileName, $imageType, $image, $folder);
            $builder = $db->table('Banner_Master');
            $builder->where('banner_id', $banner_id);
            $result = $builder->get();
---
SELECT *
FROM `Banner_Master`
WHERE `banner_id` = '58'


        $builder = $db->table('Banner_Master');
        $builder->where('banner_id', $banner_id);
        $result = $builder->update($data);
---
UPDATE `Banner_Master` SET `tag_line` = 'cefef', `subtag_line` = 'vwef', `banner_img` = '1691584693_dc3c7d3758626b6a43cd.jpg', `button` = 'Men-Wear/Suit'
WHERE `banner_id` = '58'