app/Controllers/collectionController.php

    'product_type'=>'collection',
    'product_name'=>$ProductName
];
$query=$product->save($data1);



$result=$collection->save($data);
---
INSERT INTO `product` (`ProductCode`, `product_type`, `product_name`) VALUES ('C-1PVWA', 'collection', 'dfgdf')
INSERT INTO `collection` (`image1`, `size`, `Collection_id`, `Product_name`, `Product_price`, `ProductDesc`, `ProductCode`) VALUES ('1691065563_4089cd2ae48a08b5eeb4.jpg', '1,2', '1', 'dfgdf', '44', 'ff', 'C-1PVWA')