app/Controllers/menController.php

INSERT INTO `mens` (`image2`, `image1`, `fabric`, `weave`, `care`, `fit`, `Men_id`, `Product_name`, `Product_price`, `ProductDesc`, `ProductCode`) VALUES ('1691751421_e37659ed8ca363fee867.jpg', '1691751421_ebb8671c7c8f06012870.jpg', 'check', '', '', '1', '8', 'Trouser', '5000', 'product', 'M-T8HRB')
---

        $data['fit'] = $fit_ids;
        $data['ProductCode'] = 'M-' . $getProductCode;
        $result = $mens->save($data);

INSERT INTO `product` (`product_name`, `product_type`, `ProductCode`) VALUES ('Trouser', 'mens', 'M-T8HRB')
---

        $data1['ProductCode'] = 'M-' . $getProductCode;

        $query = $productModel->save($data1);

SELECT * FROM `mens` WHERE `ProductCode`= 'M-T8HRB'
---
    public function productdetail($pc)
    {
        if ((session()->has('logged_info'))) {
            $data = session()->get('logged_info');
            $userid = $data['user_id'];
        }
        if ((session()->has('logged1_info'))) {
            $data = session()->get('logged1_info');
            $userid = $data['user_id'];
        }
        $db = db_connect();
        $result = $db->query("SELECT * FROM `mens` WHERE `ProductCode`= '$pc' ");
        // var_dump($result->getResult());exit();
        foreach ($result->getResult() as $key) {

            $ss[] = array(
                'id' => $key->Id,
                'userid' => $userid,
                'Product_code' => $key->ProductCode,
                'Product_name' => $key->Product_name,
                'Product_price' => $key->Product_price,
                'ProductDesc' => $key->ProductDesc,
                'image1' => $key->image1,
                'image2' => $key->image2,
                'image3' => $key->image3,
                'image4' => $key->image4,
                'image5' => $key->image5,
                'image6' => $key->image6,
                'size' => $key->size,
                'material' => $key->material,
                'fit'=>$key->fit,
                'folder'=>'mens',
                'table'=>'mens'
            );