app/Models/checkoutModal.php

    public function getmycart($id){
        $builder = $this->db->table('checkout');
        $builder->select('*');
        $builder->where('id',$id);
        $result = $builder->get();
---
SELECT *
FROM `checkout`
WHERE `id` = '92'